#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-QQapLKj3xgpYWZTD

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.container_registries.digitalocean_container_registry_docker_credentials.api: Refreshing state... [id=foreign-language-reader]
module.infrastructure.module.container_registries.digitalocean_container_registry.api_registry: Refreshing state... [id=foreign-language-reader]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862]
module.infrastructure.module.nginx_ingress_prod.kubernetes_secret.nginx_certificate: Refreshing state... [id=prod/nginx-certificate]
module.infrastructure.module.monitoring.kubernetes_namespace.logging: Refreshing state... [id=logging]
module.infrastructure.module.nginx_ingress_prod.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.kubernetes_namespace.qa: Refreshing state... [id=qa]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=prod/api]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=prod/api]
module.infrastructure.module.content.kubernetes_namespace.content: Refreshing state... [id=content]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=prod/elasticsearch-credentials]
module.infrastructure.module.container_registries.kubernetes_secret.registry: Refreshing state... [id=default/docker-cfg]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=prod/api]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=prod/application-secret]
module.infrastructure.kubernetes_namespace.prod: Refreshing state... [id=prod]
module.infrastructure.kubernetes_ingress.prod_ingress: Refreshing state... [id=prod/foreign-language-reader-ingress]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.nginx_ingress_prod.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=126962116]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.infrastructure.kubernetes_ingress.prod_ingress will be created
  + resource "kubernetes_ingress" "prod_ingress" {
      + id                     = (known after apply)
      + load_balancer_ingress  = (known after apply)
      + wait_for_load_balancer = false

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class"             = "nginx"
              + "nginx.ingress.kubernetes.io/enable-cors" = "true"
            }
          + generation       = (known after apply)
          + name             = "foreign-language-reader-ingress"
          + namespace        = "prod"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "api.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "api"
                          + service_port = "9000"
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "api.foreignlanguagereader.com",
                ]
              + secret_name = "nginx-certificate"
            }
        }
    }

  # module.infrastructure.module.api.kubernetes_deployment.api will be updated in-place
  ~ resource "kubernetes_deployment" "api" {
        id               = "prod/api"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "api"
                        # (9 unchanged attributes hidden)


                      ~ liveness_probe {
                          ~ initial_delay_seconds = 60 -> 30
                            # (4 unchanged attributes hidden)

                            # (1 unchanged block hidden)
                        }


                      ~ readiness_probe {
                          ~ initial_delay_seconds = 60 -> 30
                            # (4 unchanged attributes hidden)

                            # (1 unchanged block hidden)
                        }

                        # (7 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.container_registries.digitalocean_container_registry.api_registry will be destroyed
  - resource "digitalocean_container_registry" "api_registry" {
      - endpoint               = "registry.digitalocean.com/foreign-language-reader" -> null
      - id                     = "foreign-language-reader" -> null
      - name                   = "foreign-language-reader" -> null
      - server_url             = "registry.digitalocean.com" -> null
      - subscription_tier_slug = "basic" -> null
    }

  # module.infrastructure.module.container_registries.digitalocean_container_registry_docker_credentials.api will be destroyed
  - resource "digitalocean_container_registry_docker_credentials" "api" {
      - credential_expiration_time = "2070-12-09T05:23:48Z" -> null
      - docker_credentials         = (sensitive value)
      - expiry_seconds             = 1576800000 -> null
      - id                         = "foreign-language-reader" -> null
      - registry_name              = "foreign-language-reader" -> null
      - write                      = false -> null
    }

  # module.infrastructure.module.container_registries.kubernetes_secret.registry will be destroyed
  - resource "kubernetes_secret" "registry" {
      - data = (sensitive value)
      - id   = "default/docker-cfg" -> null
      - type = "kubernetes.io/dockerconfigjson" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "docker-cfg" -> null
          - namespace        = "default" -> null
          - resource_version = "106648" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/docker-cfg" -> null
          - uid              = "36e56861-c572-4d6f-81e6-c9b2878bc867" -> null
        }
    }

Plan: 1 to add, 1 to change, 3 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
